#+TITLE: Spectral Unmixing
#+SUBTITLE: GRSS Summer School
#+AUTHOR: Mathieu Fauvel
#+EMAIL: mathieu.fauvel@ensat.fr
#+DATE: [2017-04-26 Wed]--[2017-04-27 Thu]

#+INCLUDE_TAGS: export
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+OPTIONS: H:3 toc:t tags:nil properties:nil

#+COLUMNS: %40ITEM(Task) %17Effort(Estimated Effort){:} %CLOCKSUM

#+LaTeX_CLASS_OPTIONS: [10pt,aspectratio=1610]

#+BEAMER_THEME: DarkConsole
#+BEAMER_HEADER: \institute{UMR Dynafor}
#+BEAMER_HEADER: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Outline}\tableofcontents[currentsection]\end{frame}}
#+BEAMER_HEADER: \AtBeginSubsection[]{\begin{frame}<beamer>\frametitle{Outline}\tableofcontents[currentsubsection]\end{frame}}
#+BEAMER_HEADER: \setbeamercovered{again covered={\opaqueness<1->{25}}}
#+BEAMER_HEADER: \usefonttheme[onlymath]{serif}

#+LATEX_HEADER: \usepackage[english]{babel}\usepackage{etex}\usepackage{minted}\usemintedstyle{emacs}
#+LATEX_HEADER: \usepackage{tikz}\usepackage{amsmath}\usepackage[T1]{fontenc}\usepackage{lmodern}%\usepackage{arev}
#+LATEX_HEADER: \usepackage{booktabs}\usepackage[citestyle=alphabetic,bibstyle=authortitle]{biblatex}
#+LATEX_HEADER: \usepackage{pgfplots,pgfplotstable}\usetikzlibrary{pgfplots.groupplots}\usepackage[babel=true,kerning=true]{microtype}\usepackage{smartdiagram}
#+LATEX_HEADER: \addbibresource{unmix.bib}
#+LATEX_HEADER: \usetikzlibrary{mindmap,trees,shapes,arrows,spy,3d,decorations.pathmorphing,pgfplots.statistics,pgfplots.dateplot}
#+LATEX_HEADER: \pgfplotsset{compat=newest}

#+LATEX_HEADER: \hypersetup{colorlinks,linkcolor=,urlcolor=magenta}

*** NNLS
#+BEGIN_SRC python :results output :exports both
from scipy import optimize
import scipy as sp

# Load endmembers
M = sp.loadtxt("../Unmixing/figures/endmembers.csv",delimiter=',')[:,1:]
x = 0.2*M[:,0] + 0.7*M[:,1] + 0.1*M[:,2] 

# NNLS
res = optimize.nnls(M,x)
print res[0]
#+END_SRC

#+RESULTS:
: [ 0.2  0.7  0.1]

*** FCLS 1/2
#+BEGIN_SRC python :results output :exports both
from scipy import optimize
import scipy as sp

# Loss 
def loss(alpha,x,M):
    e = x-sp.dot(M,alpha)
    return (e**2).sum()

def jac(alpha,x,M):
    e = x-sp.dot(M,alpha)
    return -2*sp.dot(M.T,e)

cons = {'type':'eq','fun':lambda alpha: 1-alpha.sum(),'jac':lambda alpha: -alpha}
bnds = ((0, None), (0, None), (0, None,))

# Load endmembers
M = sp.loadtxt("../Unmixing/figures/endmembers.csv",delimiter=',')[:,1:]
x = 0.2*M[:,0] + 0.7*M[:,1] + 0.1*M[:,2] 

# Optimize
alpha0 = sp.ones((3,))/3.0
res = optimize.minimize(loss, alpha0, args=(x,M,), jac=jac,constraints=cons, method='SLSQP',
                        bounds=bnds,)
print res['x']
#+END_SRC 
#+RESULTS:
: [ 0.16441937  0.67116125  0.16441937]
